<script setup>
import { vAutoAnimate } from '@formkit/auto-animate';


const faq = ref([
    {
        id: "1",
        question: "Что входит в ежемесячное обслуживание?",
        answer: `<ul>
  <li>1. Сбор аренды, контроль просрочек, работа с депозитом.</li>
  <li>2. Оплата коммунальных, интернета и сервисных сборов от вашего имени.</li>
  <li>3. Плановое обслуживание и организация ремонта (согласуем сметы).</li>
  <li>4. Урегулирование спорных ситуаций и удержаний из депозита по актам.</li>
  <li>5. Ежемесячные отчёты: доход, загрузка, расходы + фото состояния.</li>
  <li>6. Юридическое сопровождение: продления/расторжения, уведомления, претензионная работа.</li>
  <li>7. Хранение ключей, инвентаризация, безопасность.</li>
  <li>8. Постоянный маркетинг: обновление цен и карточек, продвижение в высокий/низкий сезоны.</li>
</ul>`,
    },
    {
        id: "2",
        question: "Про тарифы и комиссию",
        answer: `Стандартная комиссия — 20% от полученной аренды.<br>
Разовые услуги (комплектация, генеральная уборка, проф. фото/видео) — по смете. Индивидуальные условия для портфелей из 3+ объектов.
`,
    },
    {
        id: "3",
        question: "Форматы сдачи",
        answer: `Краткосрочная аренда — максимальная доходность, динамичные цены, высокий сезон.<br>
Долгосрочная аренда — стабильные платежи и низкая текучка арендаторов.<br>
Мы предложим формат под ваш район и тип объекта (кондо, вилла, таунхаус).

⸻
`,
    },
    {
        id: "4",
        question: "Как часто вы перечисляете доход? ",
        answer: `Мы ценим доверие наших клиентов и обеспечиваем прозрачные, своевременные выплаты по каждому объекту.
Все арендные платежи поступают на счёт управляющей компании, после чего мы берём на себя расчёты, налоги и отчётность — вам остаётся только получать чистый доход.
<br>
Переводы выполняются ежемесячно или ежеквартально, в зависимости от условий контракта, на ваш тайский или зарубежный банковский счёт.
Каждая выплата сопровождается подробным отчётом, чтобы вы всегда видели, как работает ваш актив.
<br>
Мы действуем открыто, надёжно и в полном соответствии с законодательством Таиланда — чтобы вы чувствовали уверенность в своём доходе, где бы ни находились.`,
    },
    {
        id: "5",
        question: "Как всё организовать для передачи наследникам?",
        answer: `Мы заботимся о том, чтобы ваше имущество и доход от аренды были надёжно защищены и без лишних формальностей перешли к вашим наследникам.
Все необходимые условия можно заранее прописать в договоре управления — это гарантирует непрерывность выплат и спокойствие для вашей семьи.
<br>
При наличии тайского завещания и подтверждающих документов мы оперативно переоформляем выплаты новым владельцам, соблюдая все требования законодательства Таиланда.
Наша команда сопровождает процесс, консультирует и обеспечивает прозрачность на каждом этапе.

С нами ваш актив работает сегодня и остаётся в надёжных руках завтра..`,
    },
    {
        id: "6",
        question: "Кто подписывает договор с арендаторами?",
        answer: `Мы готовим и согласуем договор; подписывает собственник или наш представитель по доверенности.`,
    },
    {
        id: "7",
        question: "Что если портят имущество?",
        answer: `Фиксируем актом, удерживаем из депозита, при необходимости подключаем страхование и сервисную службу.`,
    },
    {
        id: "8",
        question: "Могу ли я пользоваться квартирой сам? ",
        answer: `Даже если ваша недвижимость сдана в управление, вы можете пользоваться квартирой сами в удобное для вас время. Мы согласуем с вами даты и обеспечиваем, чтобы личное пребывание не мешало аренде и доходу.
 <br>
С нашей поддержкой вы получаете свободу распоряжаться своим активом и одновременно стабильный доход — без хлопот, отчетности и управления арендаторами.`,
    },
])

// const current = ref(faq.value[0].id)
const current = ref(false)
</script>
<template>
    <div class="h-[80px] lg:h-[30px]"></div>
    <div
        class="container  mx-auto mt-10 lg:my-36 flex flex-col lg:flex-row items-start justify-between gap-6 lg:gap-10 items-stretch">
        <div class=" w-full lg:w-1/2">
            <h2 class="bl0 text-2xl lg:text-4xl mb-10">
                Управление вашей недвижимостью в Таиланде
            </h2>
            <div class="flex items-start border-b">
                <div class="text-3xl lg:text-8xl accent-text w-34 flex-shrink-0 text-right tracking-wide ">01</div>
                <div class="pl-8">
                    <div class="bl0">Аудит и договор</div>
                    <p class="my-4">
                        Проводим оценку объекта и прогноз доходности, определяем стратегию сдачи.
                        Готовим прозрачный договор на русском, английском или тайском языке.
                    </p>
                </div>
            </div>
            <div class="flex items-start border-b mt-6">
                <div class="text-3xl lg:text-8xl accent-text w-34 flex-shrink-0 text-right">02</div>
                <div class="pl-6">
                    <div class="bl0"> Подготовка и запуск</div>
                    <p class="my-4">
                        Проводим профессиональную подготовку объекта: комплектацию, уборку, премиальную фото- и
                        видеосъёмку.
                        Размещаем объявления на ведущих международных и азиатских площадках и настраиваем динамическое
                        ценообразование для максимальной загрузки и доходности.
                    </p>
                </div>
            </div>
        </div>
        <div class="relative bg-[url(/img/rule1.webp)] w-full lg:w-1/2 cursor-pointer bg-cover bg-center h-[450px]  rounded-[20px] flex flex-col justify-end p-6"
            data-aos="fade-right" data-aos-delay="200" data-aos-duration="1200" data-aos-once="true"
            data-aos-easing="ease-out-cubic">

            <div style="background-color:#96D630"
                class="absolute lg:-bottom-20 lg:right-10 hidden lg:flex flex-col justify-start  w-[250px] items-start  p-4 lg:p-6 rounded-[20px]"
                data-aos="fade-left" data-aos-delay="200" data-aos-once="true" data-aos-duration="1200"
                data-aos-easing="ease-out-cubic">
                <div class="flex gap-4 items-center mb-2">
                    <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <rect width="62" height="62" rx="31" fill="white" />
                        <g clip-path="url(#clip0_702_37)">
                            <path d="M36.375 33.8795H44.4375V31.192H36.375V33.8795Z" fill="#172E4D" />
                            <path d="M41.75 44.6295H49.8125V41.942H41.75V44.6295Z" fill="#172E4D" />
                            <path d="M39.0625 39.2545H47.125V36.567H39.0625V39.2545Z" fill="#172E4D" />
                            <path
                                d="M32.348 33.8795C32.3384 32.7457 32.0359 31.6335 31.4698 30.651C30.9037 29.6686 30.0933 28.8491 29.1171 28.2722L39.0629 11.0358L36.737 9.69202L26.557 27.3301C25.3074 27.0508 24.0077 27.0894 22.7768 27.4422C21.546 27.795 20.4232 28.4508 19.5113 29.3496C14.4808 34.202 14.8704 45.5461 14.8888 46.027C14.9027 46.374 15.0504 46.7021 15.3009 46.9426C15.5514 47.1831 15.8853 47.3173 16.2325 47.317H36.377C36.659 47.317 36.9339 47.2283 37.1627 47.0634C37.3915 46.8985 37.5626 46.6658 37.6518 46.3982C37.7409 46.1306 37.7437 45.8418 37.6596 45.5726C37.5755 45.3034 37.4088 45.0675 37.1832 44.8983C32.4267 41.3291 32.348 33.9517 32.348 33.8795ZM25.5313 29.8444C26.6068 29.8562 27.6363 30.2821 28.4057 31.0337C29.1751 31.7853 29.6251 32.8046 29.6621 33.8795C29.6621 33.9307 29.6647 34.159 29.6847 34.5095L21.7574 30.984C22.2795 30.5534 22.882 30.2309 23.5299 30.0353C24.1778 29.8397 24.8581 29.7748 25.5313 29.8444ZM30.2605 44.6295C29.1867 43.5357 28.5024 42.1193 28.3129 40.5983H25.6254C25.7217 42.0284 26.1686 43.4129 26.9266 44.6295H23.9391C23.3864 42.8856 23.0502 41.0804 22.9379 39.2545H20.2504C20.3371 41.075 20.6371 42.879 21.1442 44.6295H17.5629C17.6045 42.1619 17.9525 36.712 19.9852 33.1368L30.1077 37.6384C30.5946 40.1637 31.6319 42.5507 33.1461 44.6295H30.2605Z"
                                fill="#172E4D" />
                        </g>
                        <defs>
                            <clipPath id="clip0_702_37">
                                <rect width="43" height="43" fill="white" transform="translate(9.5 7.00452)" />
                            </clipPath>
                        </defs>
                    </svg>

                    <p><span class="bl0 m-0 leading-0 block">Подготовим</span>для сдачи</p>
                </div>
                <p><span class="bl0 m-0 leading-0">Идеальный вариант </span>для инвестирования</p>

            </div>
            <!--  -->
        </div>

    </div>
    <div
        class="container mx-auto mt-10 lg:my-36 flex flex-col-reverse lg:flex-row items-center justify-between gap-6 lg:gap-10 ">
        <div class="relative bg-[url(/img/rule2.webp)] w-full lg:w-1/2 cursor-pointer bg-cover bg-center h-[450px]  rounded-[20px] hidden lg:flex flex-col justify-end p-6"
            data-aos="fade-right" data-aos-delay="200" data-aos-duration="1200" data-aos-once="true"
            data-aos-easing="ease-out-cubic">
            <!--  -->
            <div class="absolute lg:-top-20 flex flex-col justify-start  w-[250px] items-start bg-white  p-4 lg:p-6 rounded-[20px]"
                data-aos="fade-right" data-aos-delay="200" data-aos-duration="1200" data-aos-easing="ease-out-cubic">
                <div class="flex gap-4 items-center mb-2">
                    <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <rect width="62" height="62" rx="31" fill="#96D630" />
                        <g clip-path="url(#clip0_702_37)">
                            <path
                                d="M34.9854 45.0477H31.9854V42.1102C31.984 40.942 31.5095 39.822 30.6659 38.996C29.8223 38.1699 28.6784 37.7053 27.4854 37.704H21.4854C20.2923 37.7053 19.1484 38.1699 18.3048 38.996C17.4612 39.822 16.9867 40.942 16.9854 42.1102V45.0477H13.9854V42.1102C13.9877 40.1632 14.7786 38.2967 16.1846 36.9199C17.5907 35.5432 19.4969 34.7688 21.4854 34.7665H27.4854C29.4738 34.7688 31.3801 35.5432 32.7861 36.9199C34.1921 38.2967 34.983 40.1632 34.9854 42.1102V45.0477Z"
                                fill="#172E4D" />
                            <path
                                d="M24.4854 20.079C25.3754 20.079 26.2454 20.3374 26.9854 20.8216C27.7254 21.3057 28.3022 21.9939 28.6428 22.799C28.9834 23.6042 29.0725 24.4901 28.8989 25.3448C28.7253 26.1996 28.2967 26.9847 27.6673 27.6009C27.038 28.2171 26.2362 28.6368 25.3633 28.8068C24.4903 28.9768 23.5855 28.8896 22.7633 28.5561C21.941 28.2226 21.2382 27.6578 20.7437 26.9332C20.2493 26.2086 19.9854 25.3567 19.9854 24.4852C19.9854 23.3166 20.4595 22.1959 21.3034 21.3695C22.1473 20.5432 23.2919 20.079 24.4854 20.079ZM24.4854 17.1415C23.002 17.1415 21.5519 17.5722 20.3186 18.3791C19.0852 19.1861 18.1239 20.333 17.5563 21.6749C16.9886 23.0168 16.8401 24.4934 17.1295 25.9179C17.4189 27.3425 18.1332 28.651 19.1821 29.678C20.2309 30.7051 21.5673 31.4045 23.0222 31.6879C24.477 31.9712 25.985 31.8258 27.3555 31.27C28.7259 30.7141 29.8973 29.7729 30.7214 28.5652C31.5455 27.3575 31.9854 25.9377 31.9854 24.4852C31.9854 22.5375 31.1952 20.6696 29.7887 19.2924C28.3821 17.9152 26.4745 17.1415 24.4854 17.1415Z"
                                fill="#172E4D" />
                            <path d="M52.9854 23.0165H49.9854V20.079H46.9854V17.1415H52.9854V23.0165Z" fill="#172E4D" />
                            <path d="M36.4854 17.1415H42.4854V20.079H39.4854V23.0165H36.4854V17.1415Z" fill="#172E4D" />
                            <path d="M52.9854 30.3604H49.9854V33.2979H52.9854V30.3604Z" fill="#172E4D" />
                            <path d="M49.9854 27.4229H46.9854V30.3604H49.9854V27.4229Z" fill="#172E4D" />
                            <path d="M36.4854 27.4227H39.4854V30.3602H42.4854V33.2977H36.4854V27.4227Z"
                                fill="#172E4D" />
                        </g>
                        <defs>
                            <clipPath id="clip0_702_37">
                                <rect width="48" height="47" fill="white" transform="translate(7.98535 11.2665)" />
                            </clipPath>
                        </defs>
                    </svg>

                    <p><span class="bl0 m-0 leading-0 block">Заселим</span>24/7</p>
                </div>
                <p><span class="bl0 m-0 leading-0">Обеспечим </span>хороший сервис</p>
                <!-- <ButtonsTheGreen text="Cмотреть" text-color="white" class="w-full ml-0" /> -->
            </div>
            <!--  -->
            <div style="background-color:#96D630"
                class="absolute lg:-bottom-20 lg:right-10 hidden lg:flex flex-col justify-start  w-[250px] items-start  p-4 lg:p-6 rounded-[20px]"
                data-aos="fade-left" data-aos-delay="200" data-aos-once="true" data-aos-duration="1200"
                data-aos-easing="ease-out-cubic">
                <div class="flex gap-4 items-center mb-2">
                    <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <rect width="62" height="62" rx="31" fill="white" />
                        <path
                            d="M31 8.23352C18.625 8.23352 8.5 18.3585 8.5 30.7335C8.5 43.1085 18.625 53.2335 31 53.2335C43.375 53.2335 53.5 43.1085 53.5 30.7335C53.5 18.3585 43.375 8.23352 31 8.23352ZM31 48.7335C20.875 48.7335 13 40.8585 13 30.7335C13 20.6085 20.875 12.7335 31 12.7335C41.125 12.7335 49 20.6085 49 30.7335C49 40.8585 41.125 48.7335 31 48.7335Z"
                            fill="#172E4D" />
                        <path
                            d="M26.0496 41.5335L17.7246 33.4335L20.8746 30.0585L26.0496 35.2335L38.8746 21.5085L42.2496 24.6585L26.0496 41.5335Z"
                            fill="#172E4D" />
                    </svg>


                    <p><span class="bl0 m-0 leading-0 block">Проведем </span>Check-out</p>
                </div>
                <p><span class="bl0 m-0 leading-0">Работаем для вас </span>24/7</p>
                <!-- <ButtonsTheGreen text="Cмотреть" color="white" class="w-full ml-0" /> -->
            </div>
            <!--  -->
        </div>

        <div class=" w-full lg:w-1/2">
            <!-- <h2 class="bl0 text-2xl lg:text-4xl mb-10">
                Как проходит покупка <br></br>
                недвижимости
            </h2> -->
            <div class="flex items-start border-b">
                <div class="text-3xl lg:text-8xl accent-text w-34 flex-shrink-0 text-right tracking-wide ">03</div>
                <div class="pl-8">
                    <div class="bl0"> Поиск и проверка арендатора</div>
                    <p class="my-4">
                        Проводим показы, проверяем гостей или нанимателей, фиксируем депозит и оформляем договор.
                        При краткосроке — выполняем необходимые регистрации (если применимо).
                    </p>
                </div>
            </div>

            <div class="flex items-start border-b mt-6">
                <div class="text-3xl lg:text-8xl accent-text w-34 flex-shrink-0 text-right">04</div>
                <div class="pl-6">
                    <div class="bl0">Заселение и полное управление</div>
                    <p class="my-4">
                        Check-in/Check-out 24/7, контроль платежей и коммунальных услуг, регулярные осмотры объекта.
                        Готовим отчётность собственнику и перечисляем доход удобным способом.

                    </p>
                </div>
            </div>
        </div>

    </div>

    <!--  -->
    <div class="container mx-auto my-10 lg:my-36 bg-white p-6 lg:p-10  rounded-[30px]">
        <h2 class="bl0 text-2xl lg:text-4xl mb-10 mt-10  text-center">
            Появились вопросы? <span class="light">У нас есть ответы на все!</span>
        </h2>
        <ul class="accordion">
            <li class="my-2" v-for="q in faq" :key="q.id" v-auto-animate>
                <div class="question text-[6px] md:text-normal border-b-[1px] leading-4 md:leading-normal flex justify-between py-4 lg:py-6 cursor-pointer"
                    @click="current = current === q.id ? false : q.id">
                    <p class="pr-8 md:pr-0 max-w-[500px]">{{ q.question }}</p>
                    <i class="pi pi-plus" style="font-size: 20px;"></i>

                </div>
                <p class="answer mt-4 text-sm" v-if="q.id === current" v-html="q.answer"> </p>
            </li>
        </ul>
    </div>

    <PageRating class="container mb-10 lg:mb-36" page="/rent" page-title="Управление" />
</template>
