<script setup>
import { vAutoAnimate } from '@formkit/auto-animate';


const faq = ref([
    {
        id: "1",
        question: "Можно ли оформить ипотеку или рассрочку?",
        answer: `Да, в Таиланде большинство застройщиков предлагают рассрочку на период строительства без процентов. Также доступны ипотечные программы через местные и международные банки для иностранцев. Мы подберём для вас оптимальный вариант.`,
    },
    {
        id: "2",
        question: "Как осуществляется оплата и какие требования к валюте?",
        answer: `Оплата в большинстве случаев производится в тайских батах (THB) с перевода в иностранной валюте. Все платежи проходят официально через банк, с подтверждением транзакций. Мы сопровождаем весь процесс, чтобы он был прозрачным и безопасным.`,
    },
    {
        id: "3",
        question: "Каковы перспективы аренды: доходность, правила, налоги?",
        answer: `Таиланд остаётся одним из самых популярных туристических направлений в мире. Доходность от аренды жилья достигает 5–10% годовых в зависимости от локации и типа объекта. Мы расскажем, как правильно оформить аренду, чтобы соблюдать все местные правила и оптимизировать налоги.`,
    },
    {
        id: "4",
        question: "Что учитывать при покупке off-plan недвижимости?",
        answer: `Покупка на этапе строительства (off-plan) позволяет сэкономить до 30% от цены готового объекта. Важно проверять репутацию застройщика, юридическую чистоту проекта и график платежей. Мы делаем всю проверку за вас.`,
    },
    {
        id: "5",
        question: "Как всё организовать для передачи наследникам?",
        answer: `В Таиланде предусмотрены механизмы наследования для иностранцев. Мы поможем подготовить все необходимые документы, оформить завещание и защитить ваши интересы, чтобы передача недвижимости прошла максимально просто.`,
    },
])

// const current = ref(faq.value[0].id)
const current = ref(false)
</script>
<template>
    <div class="container mx-auto my-10 lg:my-36 bg-white p-6 lg:p-10  rounded-[30px]">
        <h2 class="bl0 text-2xl lg:text-4xl mb-10 mt-10  text-center">
            Появились вопросы? <span class="light">У нас есть ответы на все!</span>
        </h2>
        <ul class="accordion">
            <li class="my-2" v-for="q in faq" :key="q.id" v-auto-animate>
                <div class="question text-[6px] md:text-normal border-b-[1px] leading-4 md:leading-normal flex justify-between py-4 lg:py-6 cursor-pointer"
                    @click="current = current === q.id ? false : q.id">
                    <p class="pr-8 md:pr-0 max-w-[500px]">{{ q.question }}</p>
                    <i class="pi pi-plus" style="font-size: 20px;"></i>

                </div>
                <p class="answer mt-4 text-sm" v-if="q.id === current" v-html="q.answer"> </p>
            </li>
        </ul>
    </div>

</template>